4538543/car/steel_ball_control/stm32f103c8t6/User/main.c
#include "stm32f10x.h"
#include "OLED.h"
#include "Key.h"
#include "Stepper.h"
#include "MaixcamUart.h"
#include "DemoControl.h"

static char *StateText(DemoState state)
{
	switch (state)
	{
		case DEMO_STATE_WAIT_VISION:
			return "WAIT ";
		case DEMO_STATE_TO_PLUS5:
			return "TO+5 ";
		case DEMO_STATE_TO_MINUS5:
			return "TO-5 ";
		case DEMO_STATE_HOLD_MINUS5:
			return "HOLD ";
		case DEMO_STATE_HOLD_CENTER:
			return "CENTR";
		case DEMO_STATE_HOLD_CAPTURED:
			return "CAPTG";
		case DEMO_STATE_FAULT:
			return "FAULT";
		default:
			return "IDLE ";
	}
}

int main(void)
{
	uint8_t key;
	uint32_t now_ms;
	uint32_t last_display_ms;
	uint16_t last_received_position;
	uint8_t has_received_position;
	uint16_t captured_target_position;
	uint8_t captured_target_available;
	uint8_t last_key_number;
	uint16_t display_target;
	MaixcamBallData ball;
	DemoStatus status;

	OLED_Init();
	Key_Init();
	Stepper_Init();
	MaixcamUart_Init();
	DemoControl_Init();

	OLED_Clear();
	OLED_ShowString(1, 1, "S:IDLE  E:0 C:0");
	OLED_ShowString(2, 1, "B:---- T:----");
	OLED_ShowString(3, 1, "M:+000 P:+000");
	OLED_ShowString(4, 1, "R:00000 K:0");
	last_display_ms = 0U;
	last_received_position = 0U;
	has_received_position = 0U;
	captured_target_position = 0U;
	captured_target_available = 0U;
	last_key_number = 0U;

	while (1)
	{
		now_ms = Stepper_GetTickMs();
		while (MaixcamUart_Poll(&ball) != 0U)
		{
			/*
			 * Display the latest decoded coordinate directly. Do not let the
			 * task-layer validity decision hide UART data that was received
			 * correctly (including TRACK_HELD frames).
			 */
			if (ball.position <= 1000U)
			{
				last_received_position = ball.position;
				has_received_position = 1U;
			}
			if (ball.target_available != 0U)
			{
				captured_target_position =
					ball.target_position;
				captured_target_available = 1U;
			}
			else
			{
				captured_target_available = 0U;
			}
			DemoControl_OnVisionFrame(&ball, now_ms);
		}
		DemoControl_Service(now_ms);

		key = Key_GetNum();
		if (key != 0U)
		{
			last_key_number = key;
		}
		if (key == 1U)
		{
			if (DemoControl_IsActive() != 0U)
			{
				DemoControl_Abort();
			}
			else
			{
				DemoControl_Start(now_ms);
			}
		}
		else if (key == 2U)
		{
			if (DemoControl_IsActive() != 0U)
			{
				DemoControl_Abort();
			}
			else
			{
				DemoControl_StartCenter(now_ms);
			}
		}
		else if (key == 3U)
		{
			if (DemoControl_IsActive() != 0U)
			{
				DemoControl_Abort();
			}
			Stepper_SetEnabled(!Stepper_IsEnabled());
		}
		else if (key == 4U)
		{
			if (DemoControl_IsActive() != 0U)
			{
				DemoControl_Abort();
			}
			else if (captured_target_available != 0U)
			{
				DemoControl_StartCapturedTarget(
					captured_target_position, now_ms);
			}
		}

		if ((uint32_t)(now_ms - last_display_ms) >= 100U)
		{
			last_display_ms = now_ms;
			status = DemoControl_GetStatus();
			OLED_ShowString(1, 3, StateText(status.state));
			OLED_ShowNum(1, 11, Stepper_IsEnabled(), 1);
			OLED_ShowNum(
				1, 15, captured_target_available, 1);
			if (has_received_position != 0U)
			{
				OLED_ShowNum(
					2, 3,
					last_received_position, 4);
			}
			else
			{
				OLED_ShowString(2, 3, "----");
			}
			if ((status.state == DEMO_STATE_IDLE) &&
				(captured_target_available == 0U))
			{
				OLED_ShowString(2, 10, "----");
			}
			else
			{
				display_target =
					(status.state == DEMO_STATE_IDLE) ?
					captured_target_position :
					status.target_normalized;
				OLED_ShowNum(2, 10, display_target, 4);
			}
			OLED_ShowSignedNum(
				3, 3, status.desired_motor_steps, 3);
			OLED_ShowSignedNum(
				3, 10,
				Stepper_GetCommandPosition(), 3);
			OLED_ShowNum(
				4, 3,
				MaixcamUart_GetValidFrameCount() % 100000U, 5);
			OLED_ShowNum(4, 11, last_key_number, 1);
		}
	}
}
